[{"Set":"SET1","Question1":"What are the SET operations that can be performed in Oracle Database? Name Four?","Question2":"What is the approach suggested by BILL INMON?","Question3":"What is the Acronym of spool?","Question4":"What is the difference between CREATE OR REPLACE PACKAGE and DROP PACKAGE + CREATE PACKAGE?","Question5":"What does LGWR stand for in Oracle?","Question6":"How do we assign the value from an Oracle Sequence to a variable in PL/SQL in Oracle 11g?Mention 2","Question7":"How does Netezza ensure ACID compliance?","Question8":"What is a correlated subquery otherwise known as?","Question9":"What happens in a Slowly Changing Dimension Type-1?","Question10":"What is the difference between INDEX hint and INDEX_ASC hint?"},
{"Set":"SET2","Question1":"What is row migration??","Question2":"How do you remove the duplicate records?","Question3":"What does KVP stand for","Question4":"How to fetch Current SCN from Oracle?","Question5":"What is In-Doubt Transaction","Question6":"What is 'Additive' Fact","Question7":"Oracle UTL_File Package is used to ","Question8":"Using 'APPEND' hint to write into tables generates undo data i.e. the transaction can be rolled back. TRUE / FALSE","Question9":"What is an orphan record?","Question10":"For which constraints does the Oracle Server implicitly create an index?"},
{"Set":"SET3","Question1":"What is an autonomous transaction?","Question2":"Which is a major problem with SQL ?","Question3":"What is SGA","Question4":"What is a pseudocolumn? Give E.g. ?","Question5":"What is a savepoint?","Question6":"Data for an IOT is stored in which manner?","Question7":"The composite partitioning supported in Oracle 10g are","Question8":"What is CYCLE in Oracle Sequence","Question9":"When an initialization parameter is changed in Oracle with SCOPE=MEMORY, what does it signify","Question10":"RENAME is an alternate name given to a table or column which do not exist once the SQL statement is executed (TRUE / FALSE)"},
{"Set":"SET4","Question1":"Storage requirements for IOT is considerably less as the PK is not duplicated? (True / False)","Question2":"What is an IDENTITY column in Oracle","Question3":"What is Dirty Buffer in Oracle?","Question4":"What is row chaining","Question5":"What is the maximum number of columns that can be specified as a partition key in interval partitioning","Question6":"What does OMF stand for in Oracle","Question7":"How can we avoid ORA-00054: resource busy error","Question8":"An Oracle DB requires a minimum of how many online redo log files?","Question9":"Issuing a COMMIT inside a trigger is possible in which type of transactions","Question10":"What is the size limitation on the result of LISTAGG function"},
{"Set":"SET5","Question1":"What is difference between UNIQUE and PRIMARY KEY constraints","Question2":" The maximum number of columns that an IOT supports is","Question3":"How to detect runtime errors in PLSQL compilation","Question4":"In interval partitioning, What are the datatypes supported for partitioning key column ","Question5":"What is a SPFILE and what are its uses?","Question6":"Give two methods for transferring a table from one schema to another","Question7":"How does COALESCE function work?","Question8":"In Netezza when are zonemaps initially created for a table? ","Question9":"What does RMAN stand for in Oracle","Question10":"When a transaction is terminated abnormally, the  data generated by the transaction is retained in GLOBAL TEMPORARY Tables. TRUE / FALSE"},
{"Set":"SET6","Question1":"What is cardinality and name some of different cardinality options?","Question2":"When to use 'Bitmap Indexes' in Oracle?","Question3":"What is a Columnar Database?","Question4":"Which trigger timing can be used when creating a trigger on a view which does not allow DML?","Question5":"IOT  supports virtual columns ( True / False)","Question6":"What is DBPITR in Oracle","Question7":"Hash - Hash partitioning was introduced in which Oracle Release?","Question8":"What tool does Oracle provide to monitor the health of its components such as Database Servers, Weblogic Servers, Storage Servers etc?","Question9":"In Netezza, what is the only predefined database user, which is able to access all objects and perform all tasks against the database","Question10":"What is a transportable tablespace in Oracle"}
]


